Tekla Open API Reference for Tekla Structures 2025
Line Constructor (Point, Vector)
 Instantiates a line defined by the given point and direction vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line(
	Point Point,
	Vector Direction
)
Public Sub New (
	Point As Point,
	Direction As Vector
)
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
A point that will be on the line.
Direction
Type: Tekla.Structures.Geometry3d.Vector
The direction of the line.
See Also
Reference
Line Class
Line Overload
Tekla.Structures.Geometry3d Namespace